; domain
(define (domain block-words)
  (:requirements :strips :typing :equality)
  (:types block)
  (:predicates (on ?x ?y - block)
	       (ontable ?x - block)
	       (clear ?x - block)
	       (handempty)
	       (holding ?x - block)
	       )

  (:action pick-up
	     :parameters (?x - block)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x - block)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x ?y - block)
	     :precondition (and (holding ?x) (clear ?y) (not (= ?x ?y)))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x ?y - block)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty) (not (= ?x ?y)))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y)))))

; problem
(define (problem block-words)
	(:domain block-words)
	(:objects
		c b j h s a p m u t l - block
	)
	(:init
		(handempty)
		(clear c)
		(on c b)
		(ontable b)
		(clear t)
		(on t l)
		(ontable l)
		(clear s)
		(on s a)
		(on a p)
		(ontable p)
		(clear j)
		(on j h)
		(ontable h)
		(clear m)
		(on m u)
		(ontable u)
	)
	(:goal (and
		;; chump
		(clear c) (ontable p) (on c h) (on h u) (on u m) (on m p) 
	))
)

; plan
1. (unstack s a)
   deleted: (clear s) (handempty) (on s a)
   added: (holding s) (clear a)
   goals met: 2 of 6
2. (put-down s)
   deleted: (holding s)
   added: (clear s) (handempty) (ontable s)
   goals met: 2 of 6
3. (unstack a p)
   deleted: (clear a) (handempty) (on a p)
   added: (holding a) (clear p)
   goals met: 2 of 6
4. (put-down a)
   deleted: (holding a)
   added: (clear a) (handempty) (ontable a)
   goals met: 2 of 6
5. (unstack m u)
   deleted: (clear m) (handempty) (on m u)
   added: (holding m) (clear u)
   goals met: 2 of 6
6. (stack m p)
   deleted: (holding m) (clear p)
   added: (clear m) (handempty) (on m p)
   goals met: 3 of 6
7. (pick-up u)
   deleted: (ontable u) (clear u) (handempty)
   added: (holding u)
   goals met: 3 of 6
8. (stack u m)
   deleted: (holding u) (clear m)
   added: (clear u) (handempty) (on u m)
   goals met: 4 of 6
9. (unstack j h)
   deleted: (clear j) (handempty) (on j h)
   added: (holding j) (clear h)
   goals met: 4 of 6
10. (put-down j)
   deleted: (holding j)
   added: (clear j) (handempty) (ontable j)
   goals met: 4 of 6
11. (pick-up h)
   deleted: (ontable h) (clear h) (handempty)
   added: (holding h)
   goals met: 4 of 6
12. (stack h u)
   deleted: (holding h) (clear u)
   added: (clear h) (handempty) (on h u)
   goals met: 5 of 6
13. (unstack c b)
   deleted: (clear c) (handempty) (on c b)
   added: (holding c) (clear b)
   goals met: 4 of 6
14. (stack c h)
   deleted: (holding c) (clear h)
   added: (clear c) (handempty) (on c h)
   goals met: 6 of 6
